Repository: Parinz/Flask-Grade-Calculator
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: th

source: Please don't enter text, just numbers and fill out every row.
th: โปรดอย่าป้อนข้อความเพียงแค่ตัวเลขและกรอกทุกแถว

source: Instructions
th: คำแนะนำ

source: Tap/Click each space and input your grades as numbers (No percentage sign). Click calculate and your answer will be in the box.
th: แตะ/คลิกแต่ละช่องว่างและใส่คะแนนของคุณเป็นตัวเลข (ไม่มีเปอร์เซ็นต์ เครื่องหมาย) คลิก 'calculate' และคําตอบของคุณจะอยู่ในกล่อง

source: WITHOUT APs FULL GRADE is
th: หากไม่มี AP เกรดเต็มคือ

source: YOUR GRADE WILL BE HERE!
th: เกรดของคุณจะอยู่ที่นี่!

source: What are Core/Electives Subjects?
th: วิชาหลัก/วิชาเลือกคืออะไร

source: Core Subject
th: วิชาหลัก

source: Elective Subject
th: วิชาเลือก

source: Back to Main Page
th: กลับไปยังหน้าหลัก

source: Tap/Click each space and input your grades as numbers (No percentage sign). Click calculate and your answer will be in the box.
th: แตะ/คลิกแต่ละช่องว่างและใส่คะแนนของคุณเป็นตัวเลข (ไม่มีเปอร์เซ็นต์ เครื่องหมาย) คลิก 'calculate' และคําตอบของคุณจะอยู่ในกล่อง

source: Out of 100
th: เต็ม 100

source: What are Core and Elective Subjects?
th: วิชาหลัก/วิชาเลือกคืออะไร

source: Core Subjects are subjects that are important as the name suggests, these are normally:
th: วิชาหลักเป็นวิชาที่มีความสำคัญตามชื่อ, โดยปกติคือ:

source: Math/Algebra or a similar class
th: คณิตศาสตร์

source: L.A or a similar class
th: L.A

source: Integrated/Science or a similar class
th: วิทยาศาสตร์

source: Geography/Ancient History or a similar class
th: ภูมิศาสตร์ / ประวัติศาสตร์โบราณ

source: There should only be
th: ควรมีเท่านั้น

source: 4 core subjects!
th: 4 วิชาหลัก!

source: The rest of the subjects are electives.
th: วิชาที่เหลือเป็นวิชาเลือก

source: There should be
th: ควรมี

source: 10 Subjects in TOTAL
th: รวม 10 วิชา

source: Do I have to put in the scores in a specific order?
th: ฉันต้องใส่คะแนนตามลำดับที่เจาะจงหรือไม่?

source: No,
th: ไม่

source: however, you do need to classify between
th: อย่างไรก็ตามคุณจำเป็นต้องแยกประเภทระหว่าง

source: CORES AND ELECTIVES.
th: วิชาลักและวิชาเลือก

source: Choose one option that is for your Class!
th: เลือกหนึ่งตัวเลือกสำหรับชั้นเรียนของคุณ!

source: Made by:
th: สร้างโดย

source: Created
th: สร้าง

source: Last Updated
th: อัปเดตล่าสุด

source: Version
th: เวอร์ชัน

source: CREDITS
th: เครดิต

source: Tap/Click each space and input your grades as numbers (No percentage sign). Click calculate and your answer will be in the box.
th: แตะ/คลิกแต่ละช่องว่างและใส่คะแนนของคุณเป็นตัวเลข (ไม่มีเปอร์เซ็นต์ เครื่องหมาย) คลิก 'calculate' และคําตอบของคุณจะอยู่ในกล่อง

source: YOUR GRADE WILL BE HERE!
th: เกรดของคุณจะอยู่ ที่นี่!
